# importing libaries

In [1]:
# import libraries
import pandas as pd
import numpy as np 
import os

In [3]:
path = r'/Users/thomaskimber/Desktop/Instacart Basket Analysis'

In [4]:
# importing original products csv
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [15]:
#importing orders as preparded data 
df_ords = pd.read_csv(r'/Users/thomaskimber/Desktop/Instacart Basket Analysis/02 Data/Prepared Data/orders_wrangled.csv', index_col = False)

In [6]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [16]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,hour_of_the_day_for_order,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [27]:
# unsure why isnt brought in a second index column but i am dropping it with the following code 
df_ords = df_ords.drop(columns=['Unnamed: 0'])

In [28]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,hour_of_the_day_for_order,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [29]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,hour_of_the_day_for_order,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [30]:
# Create a dataframe
df_test = pd. DataFrame()

In [38]:
# Create a mixed type column
df_test[ 'mix'] = ['a', 'b', 1, True]

In [41]:
df_test = df_test.drop(columns=['mix_test'])

In [42]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [43]:

for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [44]:
df_test['mix'] = df_test['mix'].astype('str')

## Product data cleaning

In [47]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [48]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [49]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [50]:
df_prods.shape

(49693, 5)

In [51]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [53]:
df_prods_clean.shape

(49677, 5)

In [54]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [55]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [56]:
df_prods_clean.shape

(49677, 5)

In [57]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [58]:
df_prods_clean_no_dups.shape

(49672, 5)

In [59]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

## task 4.5

In [61]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,hour_of_the_day_for_order,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

It looks like all the max and min values of the last three coloumns line up, there are no max or min that would indicate that the data falls outside of what expected values we would see from the data

In [62]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

I run the above scrpit and no coloumns were returned as mixed data

In [63]:
for col in df_ords.columns:
    col_types = df_ords[col].map(type)
    if not (col_types == col_types.iloc[0]).all():
        print(f"Inconsistent types in column: {col}")

To make sure i was correct i ran another way to check and nothing came back, I changed a col in the last task why might explain why the task is implying there is one to change but i am not picking it up

In [64]:
df_ords.isnull().sum()

order_id                          0
user_id                           0
order_number                      0
orders_day_of_week                0
hour_of_the_day_for_order         0
days_since_prior_order       206209
dtype: int64

I would not change this data since its value indicates its the first order of that customer since you can have any days since your piror order if its your first order. what I could do if the client wanted is to rename all NaN values to read first order but in that case you would be adding mixed values. so I would leave it as it is and ensure there was good documention to what the NaN values mean for this data

In [68]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [73]:
df_ords_dups.shape

(0, 6)

i cant find any duplicates using the method above

In [74]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))